[{"id":1,"comment_id":"cp2ibkf","submission_id":"2xkgrs","parent_id":null,"created":1425349529,"author_id":"cptnpiccard","body":"\"Ladies and gentlemen, this is the HTC Vive\"\n\n[waits for applause, hollering, hooting, minds being blown]\n\ncricketnoise.wav\n\n","link":null},{"id":2,"comment_id":"cp148vr","submission_id":"2xkh5u","parent_id":null,"created":1425242515,"author_id":"djabatt","body":"This video shows what the future will be like in a few years indeed. ","link":null},{"id":3,"comment_id":"cp1w5sf","submission_id":"2xkh5u","parent_id":null,"created":1425312384,"author_id":"Mildlynicecabbie","body":"I WANT!!","link":null},{"id":4,"comment_id":"cp0wh6r","submission_id":"2xkidz","parent_id":null,"created":1425227888,"author_id":"adejesus123","body":"[Here](http:\/\/i.imgur.com\/wxxFI9q.jpg) is the logo in case anyone needs it. Maybe for a subreddit banner?","link":null},{"id":5,"comment_id":"cp0wmf4","submission_id":"2xkidz","parent_id":"cp0wh6r","created":1425228188,"author_id":"500500","body":"Thanks.  Now we need a subreddit banner maker!\n\n\n","link":null},{"id":6,"comment_id":"cp0xcci","submission_id":"2xkidz","parent_id":"cp0wmf4","created":1425229633,"author_id":"mirdagle","body":"Try \/r\/redditlogos","link":null},{"id":8,"comment_id":"cp0wp0s","submission_id":"2xkidz","parent_id":null,"created":1425228332,"author_id":"500500","body":"Anyone who wants to mod please just ask.  I'm just trying to build an inclusive community for everyone or maybe just a collection of links.   Send a mod mail if you can help with the CSS, promotion and content.  Looking for contributors  and so will add anyone at this stage.  \n\nEdit.  ok enough mods for now.  Thanks for your interest.  I will add more mods on the basis of community activity and contributions.  Who knows if the current mods will actually buy the product and care about it and this subreddit in the future.","link":null},{"id":9,"comment_id":"cp0xd4k","submission_id":"2xkidz","parent_id":null,"created":1425229676,"author_id":"deepcube","body":"I'm excited, but that resolution is comparable to the dk2. I think it'll still suffer from the screen door effect. ","link":null},{"id":10,"comment_id":"cp0z7c7","submission_id":"2xkidz","parent_id":"cp0xd4k","created":1425233228,"author_id":"blackout24","body":"Isn't 1200x1080 per screen per eye better than a single 1080p panel with two lenses infront of it?","link":null},{"id":11,"comment_id":"cp0zb0p","submission_id":"2xkidz","parent_id":"cp0z7c7","created":1425233419,"author_id":"deepcube","body":"Yes but just slightly. 240 more columns per eye (assuming you can see all columns in both the vive and the dk2).","link":null},{"id":12,"comment_id":"cp348vd","submission_id":"2xkidz","parent_id":"cp0zb0p","created":1425405683,"author_id":"itcamefromvr","body":"Is the resolution confirmed as 2400x1080? The official \"1200x1080 per eye\" is ambiguous to me, might as well mean 2160x1200.","link":null},{"id":13,"comment_id":"cp0xkin","submission_id":"2xkidz","parent_id":null,"created":1425230081,"author_id":"StormCrawler","body":"I think it's really smart of Valve to outsource this to HTC. HTC makes smartphones (super compact hardware.) and I think that their experience with that medium will translate well when making a VR headset.","link":null},{"id":14,"comment_id":"cp14keo","submission_id":"2xkidz","parent_id":"cp0xkin","created":1425243112,"author_id":"blndcavefsh","body":"Good point. If you're moving it around with your head it ought to be light","link":null},{"id":15,"comment_id":"cp11fnb","submission_id":"2xkidz","parent_id":null,"created":1425237315,"author_id":"Mega_Nerd","body":"I just hope I'll be able to use this with my laptop.","link":null},{"id":16,"comment_id":"cp19xn9","submission_id":"2xkidz","parent_id":"cp11fnb","created":1425253013,"author_id":"jonamaton","body":"You will. If you have a &lt;$3000 gaming laptop. ","link":null},{"id":17,"comment_id":"cp2fvzf","submission_id":"2xkidz","parent_id":"cp19xn9","created":1425345175,"author_id":"cciv","body":"If you have a &gt;$3000 laptop, you'll be very disappointed and confused.","link":null},{"id":18,"comment_id":"cp2fwwa","submission_id":"2xkidz","parent_id":"cp11fnb","created":1425345222,"author_id":"cciv","body":"We use our DK2 with a laptop, though it is a high end one with proper high framerate outputs.  ","link":null},{"id":19,"comment_id":"cp2u46c","submission_id":"2xkidz","parent_id":"cp2fwwa","created":1425383887,"author_id":"Mega_Nerd","body":"Which graphics card does it have? Mine has the geforce 820m","link":null},{"id":20,"comment_id":"cp2wzf4","submission_id":"2xkidz","parent_id":"cp2u46c","created":1425392809,"author_id":"cciv","body":"980m","link":null},{"id":21,"comment_id":"cp123ra","submission_id":"2xkidz","parent_id":null,"created":1425238543,"author_id":"gophercuresself","body":"So is there any word on the FOV?","link":null},{"id":22,"comment_id":"cp14l5n","submission_id":"2xkidz","parent_id":null,"created":1425243148,"author_id":"blndcavefsh","body":"Do we have any pictures of the controllers or the \"base station?\"","link":null},{"id":23,"comment_id":"cp18mjf","submission_id":"2xkidz","parent_id":null,"created":1425250577,"author_id":"Uberdump","body":"Really excited about this. It probably sounds sad but I hate Facebook with a passion so their deal with Oculus saddened me. (Will probably buy anyway though!)\n\nThis news however has perked my VR excitement levels once again.","link":null},{"id":25,"comment_id":"cp1ka53","submission_id":"2xkidz","parent_id":null,"created":1425273460,"author_id":"ValiantPixel","body":"I LOVE it. And the fact that they provided a solid release window is the most exciting part. Can someone confirm whether it works with Mac computers?","link":null},{"id":26,"comment_id":"cp1v6tb","submission_id":"2xkidz","parent_id":"cp1ka53","created":1425310569,"author_id":"Danielvonluchau","body":"Knowing Valve it probably will. If it doesn't then you can always install windows on your mac","link":null},{"id":27,"comment_id":"cp3yklr","submission_id":"2xkidz","parent_id":"cp1ka53","created":1425467672,"author_id":"JayKayAu","body":"It will. \n\nRemember that they'll be building it to work with their Linux-based Steam Machines as well, which means it'll work for OS X.","link":null},{"id":28,"comment_id":"cp4ocna","submission_id":"2xkidz","parent_id":"cp3yklr","created":1425517220,"author_id":"ValiantPixel","body":"Great! I didn't know that the upcoming Steam Machines are to be based on Linux. Thank you for officially getting me on the Hype Train! ","link":null},{"id":29,"comment_id":"cp1m7dm","submission_id":"2xkidz","parent_id":null,"created":1425278496,"author_id":"KirillianAmurawr","body":"I just hope i will be able to order it in Russia. Oculus lost a lot of customers because of their delivery problems... some even had to rebuy from ebay :\/","link":null},{"id":30,"comment_id":"cp1tm45","submission_id":"2xkidz","parent_id":null,"created":1425307226,"author_id":"BelievesItsNotButter","body":"I strongly believe that any VR headset with less than 4k resolution is dead in the water. I've used both of the Oculus headsets, and the resolution is so atrocious that there's no way I'd ever use it for games \/ media more than for the novelty of it. \n\nVR requires presence, and you can't get it when you're looking at a wall of coloured squares hovering in front of your face.","link":null},{"id":31,"comment_id":"cp38j0f","submission_id":"2xkidz","parent_id":"cp1tm45","created":1425412198,"author_id":"Oceas","body":"The DK1 and DK2 (I have both) are worlds lower in quality than the current developer versions at Oculus and Valve, so you haven't even seen the current state of the art.  Most typical home computers can't even render high quality 1080p realtime 3D on a monitor, let alone 4K VR. Trying to release a 4K HMD right now is a bit ludicrous for all but early adopters who spend top dollar on gaming machines at home.\n","link":null},{"id":32,"comment_id":"cp28jht","submission_id":"2xkidz","parent_id":null,"created":1425332295,"author_id":"NoxiousRaven","body":"What's are the I\/O for these?","link":null},{"id":33,"comment_id":"cp15ze4","submission_id":"2xlecz","parent_id":null,"created":1425245668,"author_id":"ihatehulkamania","body":"According to [this article](http:\/\/www.wantchinatimes.com\/news-subclass-cnt.aspx?id=20150227000054&amp;cid=1204) posted to \/r\/oculus before the official HTC announcement, the headset will launch at $300 before the end of Q1 2015 (I'm taking this to mean by March 31st). Hopefully this will be the price of the devkit but I couldn't speculate as to how that might relate to the consumer version pricing -hopefully it'll be the same, otherwise unwise buyers might buy the cheaper version and have a subpar VR experience. \n\nEDIT: Also, I'm not too sure about this source; they claim that Oculus \"met with huge success after it launched the Oculus Rift in 2012\" and that Project Morpheus has already been released, so take it with a grain of salt.","link":null},{"id":34,"comment_id":"cp163ul","submission_id":"2xlecz","parent_id":"cp15ze4","created":1425245903,"author_id":"Expiscor","body":"Awesome, thanks for the reply","link":null},{"id":35,"comment_id":"cp2wjdl","submission_id":"2xlecz","parent_id":null,"created":1425391728,"author_id":"finlayvscott","body":"Well a rough estimation of $300- 350.","link":null},{"id":36,"comment_id":"cp1ct25","submission_id":"2xm8og","parent_id":null,"created":1425258632,"author_id":"Habbert","body":"&gt; Thank you for creating a better product\n\nThen DK2? (No one knows anything about CV1 yet...) it's unfair to compare DK2 to VIVE...\n\n&gt;Thank you for not being bought out by a horrible company like Facebook.\n\nWe collectively stopped overreacting about this within a week after it happened...\n\n&gt; Thank you for caring about your users.\n\nI have not seen anything to suggest Oculus does not care about their users... Quite the opposite really...\n\n&gt;  Thank you and forgive my sins for buying a DK2.\n\nFanboy status unlocked, congratulations.\n\n\nIn all seriousness, I'm hoping a little competition for Oculus will be better for everyone in the long run.","link":null},{"id":37,"comment_id":"cp1d98k","submission_id":"2xm8og","parent_id":"cp1ct25","created":1425259488,"author_id":"mastermx","body":"Then DK2? (No one knows anything about CV1 yet...) it's unfair to compare DK2 to VIVE...\n\n**Vive will destroy CV1, it's pretty obvious from the specs. Oculus don't even have an eta on CV.**\n\nWe collectively stopped overreacting about this within a week after it happened...\n\n**You have, most haven't. They just left it alone, now that there is a superior choice, this becomes a key point.**\n\nI have not seen anything to suggest Oculus does not care about their users... Quite the opposite really...\n\n**Do you seriously believe this? All I have to say is 'Facebook'. Case closed.**\n\nFanboy status unlocked, congratulations.\n\n**Supporting evil companies will hurt consumer like you and me. This is not a fanboy issue, but a way to vote with your money.**\n\nIn all seriousness, I'm hoping a little competition for Oculus will be better for everyone in the long run.\n\n**Oculus died today. There is no way anyone will support a Facebook fuzed VR system in comparison to a Steam 'Gaming' based system. Have fun getting your privacy shredded.**","link":null},{"id":38,"comment_id":"cp1dvoa","submission_id":"2xm8og","parent_id":"cp1d98k","created":1425260675,"author_id":"killthealias","body":"&gt; Have fun getting your privacy shredded.  \n  \nYes, because a company that makes a social network will somehow find a way to screw you over with a piece of hardware made by a DIFFERENT COMPANY that they just happen to own. Or are we going to start reprimanding Google for having a search engine that tracks your searches, and then proceeding to make an operating system that doesn't?","link":null},{"id":39,"comment_id":"cp1ia1d","submission_id":"2xm8og","parent_id":"cp1dvoa","created":1425269113,"author_id":"mastermx","body":"A different company lol.. They have 100% control over that company. They will screw you over like it or not. I'm going to trust my money with Gaben vs Zuckerborg tyvm","link":null},{"id":40,"comment_id":"cp1j3pg","submission_id":"2xm8og","parent_id":"cp1ia1d","created":1425270839,"author_id":"killthealias","body":"You seem to not take into account that corporations are not all run by one person. Facebook is not Zuckerberg and Valve is not Gabe. Oculus is made up by a number of industry veterans (John Carmack, Michael Abrash) who have been putting out quality products for years. Do you honestly think that they would be sticking around Oculus if they disagreed with the way Facebook is running it? Of course not.","link":null},{"id":41,"comment_id":"cp1jex4","submission_id":"2xm8og","parent_id":"cp1j3pg","created":1425271520,"author_id":"mastermx","body":"They don't have that much choice till now. In the end Facebook has full control over Oculus. I don't know about you, but I'll trust a company with a proven record of supporting PC and gaming. It's wise for me to use my money towards a Gaben run company vs a Zuckerborg version.","link":null},{"id":42,"comment_id":"cp1jgup","submission_id":"2xm8og","parent_id":"cp1jex4","created":1425271636,"author_id":"killthealias","body":"Fair enough, but you still had enough faith to support Oculus on Kickstarter in the first place, despite them having no reputation at all.","link":null},{"id":43,"comment_id":"cp1jszz","submission_id":"2xm8og","parent_id":"cp1jgup","created":1425272375,"author_id":"mastermx","body":"After they sold out, there is no way I'm trusting my money with Facebook. Anyone who supports facebook via anything they own is stupid and anti-consumer.","link":null},{"id":44,"comment_id":"cp1kswa","submission_id":"2xm8og","parent_id":"cp1jszz","created":1425274707,"author_id":"entropicdrift","body":"Targeted advertisements are anti-consumer? What's so much more evil about Facebook compared to Google, who track your information on nearly the entire internet? Is it because they aren't open source like Google tends to be with some of their projects? It's just a different methodology. Facebook is no worse than Google or Amazon or Apple. Their motives and methods aren't black and white.","link":null},{"id":45,"comment_id":"cp1kjq6","submission_id":"2xm8og","parent_id":"cp1d98k","created":1425274094,"author_id":"entropicdrift","body":"Notes:\n\"Superior choice\" - Superiority is relative. While we can be confident that Valve will have great software support, we have no idea what the price will be on the Vive. CV1 or some other unannounced HMD might have the best bang:buck ratio.\n\n\"Oculus don't even have an eta\" It's been rumored (more like hoped) that Oculus would announce their release date at GDC.\n\nAs for your argument that Oculus don't care about their users, they haven't released a consumer product yet besides the GearVR (which isn't their product). They're a new company that's inexperienced at creating software and thrust into the limelight of an unexplored field. You're expecting a polished experience from a company who aren't ready to present one yet. Furthermore, it should be noted that the reason they chose Facebook, other than the ludicrous sum of money that they were purchased for, was to ensure that VR WOULD NOT JUST BE ABOUT PC GAMING. Thus, if Oculus chooses to focus their releases on getting mobile VR going and exporing new technological possibilities with behind-the-scene R&amp;D, that's mission accomplished as far as they're concerned. \n\nOh, and Palmer Luckey still posts on the Oculus subreddit.","link":null},{"id":46,"comment_id":"cp1e30u","submission_id":"2xm8og","parent_id":null,"created":1425261064,"author_id":"RIFT-VR","body":"A tiny bit harsh but I'm more or less on the same boat. I've been playing around with Rift development since DK1 and I'm really starting to lose patience with them. The FB buyout didn't phase me at all. What has...has been their utter devotion to GearVR while neglecting the DK2 SDK. Getting stale, Oculus...","link":null},{"id":47,"comment_id":"cp1i96m","submission_id":"2xm8og","parent_id":"cp1e30u","created":1425269064,"author_id":"mastermx","body":"Yes always something more important than PC. I'm sick and tired of everyone ignoring the platform with the largest user base for VR.","link":null},{"id":48,"comment_id":"cp1s9w2","submission_id":"2xm8og","parent_id":"cp1i96m","created":1425303778,"author_id":"fuckoffmastermx","body":"Probably because there's a whole bunch of people who have better things to do than to sit on their fat ass playing video games and want to use VR for something other than fucking their waifu","link":null},{"id":49,"comment_id":"cp1f1wz","submission_id":"2xm8og","parent_id":null,"created":1425262901,"author_id":"Soapytoes","body":"Why do you dislike the DK2? I have been using mine for 3 months now and have had some great experiences with it. \n ","link":null},{"id":50,"comment_id":"cp1ibny","submission_id":"2xm8og","parent_id":"cp1f1wz","created":1425269209,"author_id":"mastermx","body":"Dk2 is ok if there was no Vive. I dislike the fact that I kickstarted Oculus then they went and sold it to Facebook of all companies. Vive seems to have way better specs and are focused on gamers and PC.","link":null},{"id":51,"comment_id":"cp1jlmm","submission_id":"2xm8og","parent_id":"cp1ibny","created":1425271925,"author_id":"Rolliender","body":"They didn't sell to facebook because they hate their backers, like you seem to think. They did it because 2 billions will let them do exactly what they need to in order to achieve true vr. \nBesides, you're completely off when you say the vive is more focused on games and pc; that one is the rift. ","link":null},{"id":52,"comment_id":"cp1jsaw","submission_id":"2xm8og","parent_id":"cp1jlmm","created":1425272333,"author_id":"mastermx","body":"The rift is focused on mobile right now. Valve will be 99.99% focused on gaming and pc. The did it because of profit, not for anything else. They turned their backs on their backers.","link":null}]